OpenNuvoton/M480BSP/SampleCode/StdDriver/HSUSBD_Audio20_Headset/usbd_audio.c
        /* Reset some variables */
        u32BufPlayIdx = 0;
        u32PlayBufPos = 0;
        u8PDMATxIdx = 0;
        u8AudioPlaying = 0;
        i8TxDataCntInBuffer = 0;

        /* flush PCM buffer */
        memset(PcmPlayBuff, 0, sizeof(PcmPlayBuff));

        /* stop usbd dma and flush FIFO */
        HSUSBD_ResetDMA();
        g_hsusbd_DmaDone = 1;
        HSUSBD->EP[EPB].EPRSPCTL |= HSUSBD_EPRSPCTL_FLUSH_Msk;
        TIMER0->CNT = 0x7657;
    }
    else
    {
        /* Disable record hardware/stop record */
        u8RecEn = 0;

        /* Disable I2S Rx function */
        I2S_DISABLE_RXDMA(I2S0);
        I2S_DISABLE_RX(I2S0);

        /* Disable PDMA channel */
        PDMA->PAUSE |= (1 << PDMA_I2S_RX_CH);
        printf("Stop Record ..  %d(%d)\n", i8TxDataCntInBuffer, i8RxDataCntInBuffer);

        /* Reset some variables */
        u32RecBufPos = 0;
        u32BufRecIdx = 0;
        u8PDMARxIdx = 0;
        i8RxDataCntInBuffer = 0;

        /* flush PCM buffer */
        memset(u8PcmRxBufFull, 0, sizeof(u8PcmRxBufFull));
        HSUSBD->EP[EPA].EPRSPCTL |= HSUSBD_EPRSPCTL_FLUSH_Msk;
    }
}

/**
  * @brief  GetPlayData, To get data from ISO OUT to play buffer.
  * @param  None.
  * @retval None.
  */
void UAC_GetPlayData(void)
{
    volatile uint32_t u32len;

    /* if buffer has enough data, play it!! */
    if (!u8AudioPlaying && (i8TxDataCntInBuffer >= (PDMA_TXBUFFER_CNT/2+1)))
    {
        AudioStartPlay(g_usbd_SampleRate);
        u8AudioPlaying = 1;
    }

    if (HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk)
        return;

    u32len = HSUSBD->EP[EPB].EPDATCNT & 0xffff;
    if (u32len == 0)
        return;

    /* Ring buffer check */
    PDMA_DisableInt(PDMA,PDMA_I2S_TX_CH, 0);
    if ((u32PlayBufPos + u32PacketSize) > u32BuffLen)
    {
        PcmPlayBuffLen[u32BufPlayIdx] = u32PlayBufPos;
        DMA_TXDESC[u32BufPlayIdx].ctl = (DMA_TXDESC[u32BufPlayIdx].ctl & ~PDMA_DSCT_CTL_TXCNT_Msk )|((u32PlayBufPos-1)<<PDMA_DSCT_CTL_TXCNT_Pos);
        u32PlayBufPos = 0;
        u32BufPlayIdx ++;

        /* change buffer index */
        if(u32BufPlayIdx >= PDMA_TXBUFFER_CNT)
            u32BufPlayIdx=0;
        /* increase data count in buffer */
        i8TxDataCntInBuffer ++;
        if (i8TxDataCntInBuffer > PDMA_TXBUFFER_CNT)
            i8TxDataCntInBuffer = 7;
    }
    PDMA_EnableInt(PDMA,PDMA_I2S_TX_CH, 0);

    /* active usbd DMA to read data from FIFO and then send to I2S */
    HSUSBD_SET_DMA_WRITE(ISO_OUT_EP_NUM);
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk|HSUSBD_BUSINTEN_SUSPENDIEN_Msk|HSUSBD_BUSINTEN_RSTIEN_Msk|HSUSBD_BUSINTEN_VBUSDETIEN_Msk);
    HSUSBD_SET_DMA_ADDR((uint32_t)&PcmPlayBuff[u32BufPlayIdx][u32PlayBufPos]);
    HSUSBD_SET_DMA_LEN(u32PacketSize << 2);     /* byte count */
    g_hsusbd_DmaDone = 0;
    HSUSBD_ENABLE_DMA();

    u32PlayBufPos += u32PacketSize;
}


void AudioStartPlay(uint32_t u32SampleRate)
{
    UAC_DeviceEnable(1);

    /* Configure TX PDMA SG table */
    PDMA_WriteTxSGTable();

    /* Configure codec to specific sample rate */
#if NAU8822
    NAU8822_ConfigSampleRate(u32SampleRate);
#else
    NAU88L25_ConfigSampleRate(u32SampleRate);
#endif

    /* Enable I2S Tx function */
    I2S_ENABLE_TXDMA(I2S0);
    I2S_ENABLE_TX(I2S0);

    /* Enable PDMA channel */
    PDMA->CHCTL |= (1 << PDMA_I2S_TX_CH);
    printf("Start Play ... \n");

    // workaround for PDMA suspend
    PDMA->DSCT[PDMA_I2S_TX_CH].CTL = 0;
    PDMA->DSCT[PDMA_I2S_TX_CH].CTL = 2;
}

/**
  * @brief  SendRecData, prepare the record data for next ISO transfer.
  * @param  None.
  * @retval None.
  */
void UAC_SendRecData(void)
{
    uint32_t volatile i;

    if (HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk)
        return;

    PDMA_DisableInt(PDMA,PDMA_I2S_RX_CH, 0);
    /* when record buffer full, send data to host */
    if (u8PcmRxBufFull[u32BufRecIdx])
    {
        if ((u32RecBufPos + u32PacketSize) > u32RxBuffLen)
        {
            /* Set empty flag */
            u8PcmRxBufFull[u32BufRecIdx] = 0;
            u32RecBufPos = 0;
            /* Change to next PCM buffer */
            u32BufRecIdx ++;
            if(u32BufRecIdx >= PDMA_RXBUFFER_CNT)
                u32BufRecIdx=0;
            i8RxDataCntInBuffer --;
            if (i8RxDataCntInBuffer <= 0)
                i8RxDataCntInBuffer = 0;
        }

        HSUSBD_SET_DMA_READ(ISO_IN_EP_NUM);
        HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk|HSUSBD_BUSINTEN_SUSPENDIEN_Msk|HSUSBD_BUSINTEN_RSTIEN_Msk|HSUSBD_BUSINTEN_VBUSDETIEN_Msk);
        HSUSBD_SET_DMA_ADDR((uint32_t)&PcmRecBuff[u32BufRecIdx][u32RecBufPos]);
        HSUSBD_SET_DMA_LEN(u32PacketSize << 2);     /* byte count */
        g_hsusbd_DmaDone = 0;
        HSUSBD_ENABLE_DMA();
        u32RecBufPos += u32PacketSize;
    }
    else
    {
        i8RxDataCntInBuffer = 0;
        /* send zero packet when no data */
        HSUSBD->EP[EPA].EPRSPCTL = HSUSBD_EPRSPCTL_ZEROLEN_Msk;
    }
    PDMA_EnableInt(PDMA,PDMA_I2S_RX_CH, 0);
}

void AudioStartRecord(uint32_t u32SampleRate)
{
    /* Configure RX PDMA SG table */
    PDMA_WriteRxSGTable();

    /* Configure codec to specific sample rate */
#if NAU8822
    NAU8822_ConfigSampleRate(u32SampleRate);
#else
    NAU88L25_ConfigSampleRate(u32SampleRate);
#endif

    /* Enable I2S Tx function */
    I2S_ENABLE_RXDMA(I2S0);
    I2S_ENABLE_RX(I2S0);

    /* Enable PDMA channel */
    PDMA->CHCTL |= (1 << PDMA_I2S_RX_CH);
    printf("Start Record ... \n");

    PDMA->DSCT[PDMA_I2S_RX_CH].CTL = 0;
    PDMA->DSCT[PDMA_I2S_RX_CH].CTL = 2;
}

//======================================================
void TMR0_IRQHandler(void)
{
    TIMER_ClearIntFlag(TIMER0);

#if NAU8822
    if (u8AudioPlaying)
    {
        if((i8TxDataCntInBuffer >= (PDMA_TXBUFFER_CNT/2)) && (i8TxDataCntInBuffer <= (PDMA_TXBUFFER_CNT/2+1)))
            AdjustCodecPll(E_RS_NONE);
        else if(i8TxDataCntInBuffer >= (PDMA_TXBUFFER_CNT-2))
            AdjustCodecPll(E_RS_UP);
        else
            AdjustCodecPll(E_RS_DOWN);
    }
#else
    if (u8AudioPlaying && !gIsMac)
    {
        if((i8TxDataCntInBuffer >= (PDMA_TXBUFFER_CNT/2)) && (i8TxDataCntInBuffer <= (PDMA_TXBUFFER_CNT/2+1)))
        {
            u32AdjSample = (u32PacketSize & 0xffff) << 16;
        }
        else if(i8TxDataCntInBuffer >= (PDMA_TXBUFFER_CNT-2))
        {
            u32AdjSample = (((u32PacketSize - 1) & 0xffff) << 16) | 0xf000;
        }
        else
        {
            u32AdjSample = ((u32PacketSize & 0xffff) << 16) | 0x1000;
        }
    }
#endif
}




